/*author : Mariam Ashraf Fekry */
import React from 'react';
import "./About-us-components/css/generalAboutUsStyle.css";
import {About} from "./About-us-components/About";
import {NOON} from "./About-us-components/NOON";
import {Photo} from "./About-us-components/Photo";
import { Logo } from './About-us-components/Logo';
import { Vision } from './About-us-components/Vision';
import { PhotoCopy } from './About-us-components/PhotoCopy';
import { Mission } from './About-us-components/Mission';
import { LogoCopy } from './About-us-components/LogoCopy';
export const AboutUs =(props)=>
{
    props={
        AboutNoon:{
            content:'عن نون',
        },
        noon:{
            title:'نون',
            content:'عهٌدجديٌد،دا اً ُجملةتتك ررع مسامعنامن القادة   كل ا جا ت عندما يتم انتخابهم أو تأييدهم أو اعت ئهم  ناصب التوجيه والتعديلوالفكروالتأث ..جميلٌةهذهالعبارة فهي تبعث   نفس ا تلقي ا يجابية والتقدم وا مــل والطموح وأيضاً السعادة حسب الدراسات الحديثة.عهٌدجديٌد،دا اً ُجملةتتك ررع مسامعنامن القادة   كل ا جا ت عندما يتم انتخابهم أو تأييدهم أو اعت ئهم  ناصب التوجيه والتعديلوالفكروالتأث ..جميلٌةهذهالعبارة فهي تبعث   نفس ا تلقي ا يجابية والتقدم وا مــل والطموح وأيضاً السعادةحسب الدراسات الحديثة'
            ,id:1
        },
        photo:{
            image:'./images/Gathering.png'
        },
        logo:{
            image:'./images/logo.png'
        },
        vision:{
            title:'رؤيتنا',
            content:'عهٌدجديٌد،دا اً ُجملةتتك ررع مسامعنامن القادة   كل ا جا ت عندما يتم انتخابهم أو تأييدهم أو اعت ئهم  ناصب التوجيه والتعديلوالفكروالتأث ..جميلٌةهذهالعبارة فهي تبعث   نفس ا تلقي ا يجابية والتقدم وا مــل والطموح وأيضاً السعادة حسب الدراسات الحديثة. عهٌدجديٌد،دا اً ُجملةتتك ررع مسامعنامن القادة   كل ا جا ت عندما يتم انتخابهم أو تأييدهم أو اعت ئهم  ناصب التوجيه والتعديلوالفكروالتأث ..جميلٌةهذهالعبارة فهي تبعث   نفس ا تلقي ا يجابية والتقدم وا مــل والطموح وأيضاً السعادة حسب الدراسات الحديثة. عهٌدجديٌد،دا اً ُجملةتتك ررع مسامعنامن القادة   كل ا جا ت عندما يتم انتخابهم أو تأييدهم أو اعت ئهم  ناصب التوجيه والتعديلوالفكروالتأث ..جميلٌةهذهالعبارة فهي تبعث   نفس ا تلقي ا يجابية والتقدم وا مــل والطموح وأيضاً السعادة حسب الدراسات الحديثة. عهٌدجديٌد،دا اً ُجملةتتك ررع مسامعنامن القادة   كل ا جا ت عندما يتم انتخابهم أو تأييدهم أو اعت ئهم  ناصب التوجيه والتعديلوالفكروالتأث ..جميلٌةهذهالعبارة فهي تبعث   نفس ا تلقي ا يجابية والتقدم وا مــل والطموح وأيضاً السعادة حسب الدراسات الحديثة.'
            ,image:'./images/Laundry.png'
        },
        photoCopy:{
            image:'./images/Gathering.png'
        },
        mission:{
            title:'رسالتنا',
            content:'عهٌدجديٌد،دا اً ُجملةتتك ررع مسامعنامن القادة   كل ا جا ت عندما يتم انتخابهم أو تأييدهم أو اعت ئهم  ناصب التوجيه والتعديلوالفكروالتأث ..جميلٌةهذهالعبارة فهي تبعث   نفس ا تلقي ا يجابية والتقدم وا مــل والطموح وأيضاً السعادة عهٌدجديٌد،دا اً ُجملةتتك ررع مسامعنامن القادة   كل ا جا ت عندما يتم انتخابهم أو تأييدهم أو اعت ئهم  ناصب التوجيه والتعديلوالفكروالتأث ..جميلٌةهذهالعبارة فهي تبعث   نفس ا تلقي ا يجابية والتقدم وا مــل والطموح وأيضاً السعادة عهٌدجديٌد،دا اً ُجملةتتك ررع مسامعنامن القادة   كل ا جا ت عندما يتم انتخابهم أو تأييدهم أو اعت ئهم  ناصب التوجيه والتعديلوالفكروالتأث ..جميلٌةهذهالعبارة فهي تبعث   نفس ا تلقي ا يجابية والتقدم وا مــل والطموح وأيضاً السعادة عهٌدجديٌد،دا اً ُجملةتتك ررع مسامعنامن القادة   كل ا جا ت عندما يتم انتخابهم أو تأييدهم أو اعت ئهم  ناصب التوجيه والتعديلوالفكروالتأث ..جميلٌةهذهالعبارة فهي تبعث   نفس ا تلقي ا يجابية والتقدم وا مــل والطموح وأيضاً السعادة.'
            ,id:1
        },
        logoCopy:{
            image:'./images/whiteLogo.png'
        }
    }
    return(
        <div className="container aboutus">
            <div className="row aboutus_row1">                    
                <About aboutNoon={props.AboutNoon} />
                <NOON noon={props.noon}/>
                <Photo photo={props.photo}/>
                <Logo logo={props.logo}/>
            </div>
            <Vision vision={props.vision}/>
            <div className="row aboutus_row3">
                <PhotoCopy photoCopy={props.photoCopy}/>
                <Mission mission={props.mission}/>
                <LogoCopy logoCopy={props.logoCopy}/>
            </div>
        </div>
    );
}
